In [1]:
import pyspark as ps
from pyspark.sql import SparkSession

In [2]:
spark1 = SparkSession.builder.appName('Ops').getOrCreate()

In [3]:
path = "yelp_dataset/user.json"
user_df = spark1.read.json(path)

In [4]:
user_df.printSchema()
user_df.createOrReplaceTempView("user")

root
 |-- average_stars: double (nullable = true)
 |-- compliment_cool: long (nullable = true)
 |-- compliment_cute: long (nullable = true)
 |-- compliment_funny: long (nullable = true)
 |-- compliment_hot: long (nullable = true)
 |-- compliment_list: long (nullable = true)
 |-- compliment_more: long (nullable = true)
 |-- compliment_note: long (nullable = true)
 |-- compliment_photos: long (nullable = true)
 |-- compliment_plain: long (nullable = true)
 |-- compliment_profile: long (nullable = true)
 |-- compliment_writer: long (nullable = true)
 |-- cool: long (nullable = true)
 |-- elite: string (nullable = true)
 |-- fans: long (nullable = true)
 |-- friends: string (nullable = true)
 |-- funny: long (nullable = true)
 |-- name: string (nullable = true)
 |-- review_count: long (nullable = true)
 |-- useful: long (nullable = true)
 |-- user_id: string (nullable = true)
 |-- yelping_since: string (nullable = true)

In [5]:
#business_df.createOrReplaceTempView("business")

In [6]:
sample_user_query = spark1.sql("SELECT * from user LIMIT 1")

In [7]:
sample_user_query.show()

+-------------+---------------+---------------+----------------+--------------+---------------+---------------+---------------+-----------------+----------------+------------------+-----------------+----+--------------+----+--------------------+-----+------+------------+------+--------------------+-------------------+
|average_stars|compliment_cool|compliment_cute|compliment_funny|compliment_hot|compliment_list|compliment_more|compliment_note|compliment_photos|compliment_plain|compliment_profile|compliment_writer|cool|         elite|fans|             friends|funny|  name|review_count|useful|             user_id|      yelping_since|
+-------------+---------------+---------------+----------------+--------------+---------------+---------------+---------------+-----------------+----------------+------------------+-----------------+----+--------------+----+--------------------+-----+------+------------+------+--------------------+-------------------+
|         4.03|              1|              0|               1|             2|              0|              0|              1|                0|               1|                 0|                2|  25|2015,2016,2017|   5|c78V-rj8NQcQjOI8K...|   17|Rashmi|          95|    84|l6BmjZMeQD3rDxWUb...|2013-10-08 23:11:33|
+-------------+---------------+---------------+----------------+--------------+---------------+---------------+---------------+-----------------+----------------+------------------+-----------------+----+--------------+----+--------------------+-----+------+------------+------+--------------------+-------------------+

In [8]:
#states_breakdown_df = spark1.sql("SELECT state, count(*) from business group by state")
path = "yelp_dataset/business.json"
business_df = spark1.read.json(path)
business_df.printSchema()

root
 |-- address: string (nullable = true)
 |-- attributes: struct (nullable = true)
 |    |-- AcceptsInsurance: string (nullable = true)
 |    |-- AgesAllowed: string (nullable = true)
 |    |-- Alcohol: string (nullable = true)
 |    |-- Ambience: string (nullable = true)
 |    |-- BYOB: string (nullable = true)
 |    |-- BYOBCorkage: string (nullable = true)
 |    |-- BestNights: string (nullable = true)
 |    |-- BikeParking: string (nullable = true)
 |    |-- BusinessAcceptsBitcoin: string (nullable = true)
 |    |-- BusinessAcceptsCreditCards: string (nullable = true)
 |    |-- BusinessParking: string (nullable = true)
 |    |-- ByAppointmentOnly: string (nullable = true)
 |    |-- Caters: string (nullable = true)
 |    |-- CoatCheck: string (nullable = true)
 |    |-- Corkage: string (nullable = true)
 |    |-- DietaryRestrictions: string (nullable = true)
 |    |-- DogsAllowed: string (nullable = true)
 |    |-- DriveThru: string (nullable = true)
 |    |-- GoodForDancing: string (nullable = true)
 |    |-- GoodForKids: string (nullable = true)
 |    |-- GoodForMeal: string (nullable = true)
 |    |-- HairSpecializesIn: string (nullable = true)
 |    |-- HappyHour: string (nullable = true)
 |    |-- HasTV: string (nullable = true)
 |    |-- Music: string (nullable = true)
 |    |-- NoiseLevel: string (nullable = true)
 |    |-- Open24Hours: string (nullable = true)
 |    |-- OutdoorSeating: string (nullable = true)
 |    |-- RestaurantsAttire: string (nullable = true)
 |    |-- RestaurantsCounterService: string (nullable = true)
 |    |-- RestaurantsDelivery: string (nullable = true)
 |    |-- RestaurantsGoodForGroups: string (nullable = true)
 |    |-- RestaurantsPriceRange2: string (nullable = true)
 |    |-- RestaurantsReservations: string (nullable = true)
 |    |-- RestaurantsTableService: string (nullable = true)
 |    |-- RestaurantsTakeOut: string (nullable = true)
 |    |-- Smoking: string (nullable = true)
 |    |-- WheelchairAccessible: string (nullable = true)
 |    |-- WiFi: string (nullable = true)
 |-- business_id: string (nullable = true)
 |-- categories: string (nullable = true)
 |-- city: string (nullable = true)
 |-- hours: struct (nullable = true)
 |    |-- Friday: string (nullable = true)
 |    |-- Monday: string (nullable = true)
 |    |-- Saturday: string (nullable = true)
 |    |-- Sunday: string (nullable = true)
 |    |-- Thursday: string (nullable = true)
 |    |-- Tuesday: string (nullable = true)
 |    |-- Wednesday: string (nullable = true)
 |-- is_open: long (nullable = true)
 |-- latitude: double (nullable = true)
 |-- longitude: double (nullable = true)
 |-- name: string (nullable = true)
 |-- postal_code: string (nullable = true)
 |-- review_count: long (nullable = true)
 |-- stars: double (nullable = true)
 |-- state: string (nullable = true)

In [9]:
business_df.createOrReplaceTempView("business")

In [10]:
sample_business_query = spark1.sql("SELECT city, state, COUNT(*) c from business GROUP BY city, state ORDER BY c DESC")

In [11]:
sample_business_query.show()

+---------------+-----+-----+
|           city|state|    c|
+---------------+-----+-----+
|      Las Vegas|   NV|29361|
|        Toronto|   ON|18904|
|        Phoenix|   AZ|18764|
|      Charlotte|   NC| 9507|
|     Scottsdale|   AZ| 8837|
|        Calgary|   AB| 7735|
|     Pittsburgh|   PA| 7016|
|       Montréal|   QC| 6449|
|           Mesa|   AZ| 6080|
|      Henderson|   NV| 4892|
|          Tempe|   AZ| 4550|
|       Chandler|   AZ| 4307|
|      Cleveland|   OH| 3605|
|       Glendale|   AZ| 3542|
|        Madison|   WI| 3493|
|        Gilbert|   AZ| 3460|
|    Mississauga|   ON| 3112|
|         Peoria|   AZ| 1919|
|        Markham|   ON| 1766|
|North Las Vegas|   NV| 1547|
+---------------+-----+-----+
only showing top 20 rows

In [12]:
path = "yelp_dataset/review.json"
review_df = spark1.read.json(path)
review_df.printSchema()

root
 |-- business_id: string (nullable = true)
 |-- cool: long (nullable = true)
 |-- date: string (nullable = true)
 |-- funny: long (nullable = true)
 |-- review_id: string (nullable = true)
 |-- stars: double (nullable = true)
 |-- text: string (nullable = true)
 |-- useful: long (nullable = true)
 |-- user_id: string (nullable = true)

In [13]:
review_df.createOrReplaceTempView("review")

In [14]:
review_counts = spark1.sql("SELECT city, state, COUNT(*) c from business JOIN review ON business.business_id=review.business_id GROUP BY city,state ORDER BY c DESC")
review_counts.show()

+---------------+-----+-------+
|           city|state|      c|
+---------------+-----+-------+
|      Las Vegas|   NV|2030062|
|        Phoenix|   AZ| 734105|
|        Toronto|   ON| 525422|
|     Scottsdale|   AZ| 387550|
|      Charlotte|   NC| 309406|
|     Pittsburgh|   PA| 225489|
|      Henderson|   NV| 219880|
|          Tempe|   AZ| 202074|
|           Mesa|   AZ| 168311|
|       Chandler|   AZ| 157569|
|       Montréal|   QC| 151238|
|        Gilbert|   AZ| 129028|
|      Cleveland|   OH| 114389|
|        Madison|   WI| 104634|
|       Glendale|   AZ| 100299|
|        Calgary|   AB|  97647|
|         Peoria|   AZ|  57857|
|    Mississauga|   ON|  55585|
|        Markham|   ON|  51296|
|North Las Vegas|   NV|  50937|
+---------------+-----+-------+
only showing top 20 rows

In [15]:
review_counts = spark1.sql("SELECT state, COUNT(*) c, AVG(review.stars) s from business JOIN review ON business.business_id=review.business_id GROUP BY state ORDER BY c DESC")
review_counts.show(100, False)

+-----+-------+------------------+
|state|c      |s                 |
+-----+-------+------------------+
|NV   |2320491|3.755840466521956 |
|AZ   |2082951|3.7554661631502615|
|ON   |784461 |3.537222373068897 |
|NC   |408060 |3.671072881439004 |
|OH   |321345 |3.6708926543123432|
|PA   |290097 |3.716132879691965 |
|QC   |179039 |3.844201542680645 |
|WI   |133660 |3.71846476133473  |
|AB   |99639  |3.576802256144682 |
|IL   |42371  |3.582804276509877 |
|SC   |21272  |3.5886611508085746|
|TX   |1071   |4.144724556489263 |
|FL   |726    |1.5110192837465564|
|NY   |283    |3.0636042402826855|
|CA   |251    |3.9282868525896415|
|WA   |19     |1.6842105263157894|
|CT   |17     |3.4705882352941178|
|VA   |16     |4.0               |
|NM   |14     |2.7142857142857144|
|GA   |14     |3.0               |
|XGM  |14     |3.7142857142857144|
|NE   |12     |2.5833333333333335|
|AL   |12     |4.083333333333333 |
|VT   |8      |4.5               |
|XWY  |8      |4.5               |
|NJ   |8      |4.875             |
|AK   |7      |2.857142857142857 |
|AR   |7      |2.0               |
|UT   |4      |2.25              |
|BAS  |4      |3.75              |
|DOW  |4      |3.25              |
|BC   |3      |1.3333333333333333|
|TN   |3      |5.0               |
|XGL  |3      |4.333333333333333 |
|DUR  |3      |3.6666666666666665|
|CON  |3      |3.6666666666666665|
+-----+-------+------------------+

In [16]:
review_counts = spark1.sql("SELECT COUNT(*) FROM review")
review_counts.show()

+--------+
|count(1)|
+--------+
| 6685900|
+--------+

In [17]:
review_counts = spark1.sql("SELECT COUNT(*) FROM business JOIN review ON business.business_id = review.business_id")
review_counts.show()

+--------+
|count(1)|
+--------+
| 6685900|
+--------+

In [18]:
review_counts = spark1.sql("SELECT COUNT(*) FROM business JOIN review ON business.business_id = review.business_id")
review_counts.show()

+--------+
|count(1)|
+--------+
| 6685900|
+--------+

In [19]:
dates = spark1.sql("SELECT COUNT(*) FROM review w")

In [20]:
datestest = spark1.sql("SELECT EXTRACT(YEAR FROM date) y, COUNT(*) FROM review GROUP BY y ORDER BY y")
datestest.show(50, False)

+----+--------+
|y   |count(1)|
+----+--------+
|2004|13      |
|2005|876     |
|2006|5081    |
|2007|21389   |
|2008|57347   |
|2009|101173  |
|2010|187387  |
|2011|302867  |
|2012|367090  |
|2013|491294  |
|2014|704862  |
|2015|952400  |
|2016|1098786 |
|2017|1217673 |
|2018|1177662 |
+----+--------+

In [21]:
datestest = spark1.sql("SELECT EXTRACT(YEAR FROM date) y, EXTRACT(MONTH FROM date) m, COUNT(*) FROM review GROUP BY y,m ORDER BY y DESC,m DESC")
datestest.show(150, False)

+----+---+--------+
|y   |m  |count(1)|
+----+---+--------+
|2018|11 |51786   |
|2018|10 |103643  |
|2018|9  |103980  |
|2018|8  |120381  |
|2018|7  |126571  |
|2018|6  |116064  |
|2018|5  |115846  |
|2018|4  |115534  |
|2018|3  |119213  |
|2018|2  |100004  |
|2018|1  |104640  |
|2017|12 |93115   |
|2017|11 |94266   |
|2017|10 |100556  |
|2017|9  |102393  |
|2017|8  |111431  |
|2017|7  |116050  |
|2017|6  |105827  |
|2017|5  |104915  |
|2017|4  |102205  |
|2017|3  |102373  |
|2017|2  |90085   |
|2017|1  |94457   |
|2016|12 |83494   |
|2016|11 |79423   |
|2016|10 |87117   |
|2016|9  |89115   |
|2016|8  |99052   |
|2016|7  |104258  |
|2016|6  |96589   |
|2016|5  |94926   |
|2016|4  |92886   |
|2016|3  |93927   |
|2016|2  |88004   |
|2016|1  |89995   |
|2015|12 |75144   |
|2015|11 |76795   |
|2015|10 |82188   |
|2015|9  |80668   |
|2015|8  |92089   |
|2015|7  |90838   |
|2015|6  |82515   |
|2015|5  |80100   |
|2015|4  |75784   |
|2015|3  |78035   |
|2015|2  |66395   |
|2015|1  |71849   |
|2014|12 |59773   |
|2014|11 |58920   |
|2014|10 |61788   |
|2014|9  |60443   |
|2014|8  |69443   |
|2014|7  |69440   |
|2014|6  |58963   |
|2014|5  |58075   |
|2014|4  |54817   |
|2014|3  |54939   |
|2014|2  |47114   |
|2014|1  |51147   |
|2013|12 |43144   |
|2013|11 |41769   |
|2013|10 |42386   |
|2013|9  |42342   |
|2013|8  |46889   |
|2013|7  |44790   |
|2013|6  |40725   |
|2013|5  |39455   |
|2013|4  |38570   |
|2013|3  |39079   |
|2013|2  |34136   |
|2013|1  |38009   |
|2012|12 |30154   |
|2012|11 |30150   |
|2012|10 |31258   |
|2012|9  |30451   |
|2012|8  |33586   |
|2012|7  |34528   |
|2012|6  |31141   |
|2012|5  |29168   |
|2012|4  |28839   |
|2012|3  |29314   |
|2012|2  |27563   |
|2012|1  |30938   |
|2011|12 |24798   |
|2011|11 |25696   |
|2011|10 |24822   |
|2011|9  |25429   |
|2011|8  |29900   |
|2011|7  |28653   |
|2011|6  |25883   |
|2011|5  |24274   |
|2011|4  |23473   |
|2011|3  |24972   |
|2011|2  |21541   |
|2011|1  |23426   |
|2010|12 |18764   |
|2010|11 |17619   |
|2010|10 |16839   |
|2010|9  |17236   |
|2010|8  |19586   |
|2010|7  |16917   |
|2010|6  |13792   |
|2010|5  |12850   |
|2010|4  |14063   |
|2010|3  |14648   |
|2010|2  |11796   |
|2010|1  |13277   |
|2009|12 |9409    |
|2009|11 |8575    |
|2009|10 |8856    |
|2009|9  |9235    |
|2009|8  |9853    |
|2009|7  |9423    |
|2009|6  |8150    |
|2009|5  |7715    |
|2009|4  |7735    |
|2009|3  |7691    |
|2009|2  |6545    |
|2009|1  |7986    |
|2008|12 |5917    |
|2008|11 |5806    |
|2008|10 |5771    |
|2008|9  |6389    |
|2008|8  |6513    |
|2008|7  |5080    |
|2008|6  |4537    |
|2008|5  |4072    |
|2008|4  |3722    |
|2008|3  |3360    |
|2008|2  |2949    |
|2008|1  |3231    |
|2007|12 |2050    |
|2007|11 |1765    |
|2007|10 |1938    |
|2007|9  |1966    |
|2007|8  |2311    |
|2007|7  |2196    |
|2007|6  |1982    |
|2007|5  |1448    |
|2007|4  |1300    |
|2007|3  |1839    |
|2007|2  |1396    |
|2007|1  |1198    |
|2006|12 |585     |
|2006|11 |552     |
|2006|10 |580     |
|2006|9  |556     |
|2006|8  |570     |
|2006|7  |338     |
|2006|6  |243     |
+----+---+--------+
only showing top 150 rows

In [22]:
phoenix_reviews = spark1.sql("SELECT EXTRACT(YEAR FROM date) y, EXTRACT(MONTH FROM date) m, AVG(review.stars) s, COUNT(*) c FROM business JOIN review ON business.business_id=review.business_id WHERE city = 'Phoenix' GROUP BY y,m ORDER BY y DESC,m DESC")
phoenix_reviews.show(100, False)

+----+---+------------------+-----+
|y   |m  |s                 |c    |
+----+---+------------------+-----+
|2018|11 |3.7924907810928596|5966 |
|2018|10 |3.7710658601005367|11737|
|2018|9  |3.750930356193514 |11286|
|2018|8  |3.798352295017654 |12745|
|2018|7  |3.7931681681681684|13320|
|2018|6  |3.7911895674300253|12576|
|2018|5  |3.7747609942638625|13075|
|2018|4  |3.7958705188322495|13222|
|2018|3  |3.7846342165898617|13888|
|2018|2  |3.796786561986489 |10954|
|2018|1  |3.8223363509749304|11488|
|2017|12 |3.7571096042910637|9881 |
|2017|11 |3.7494858485946527|10211|
|2017|10 |3.8122740499074155|11341|
|2017|9  |3.7699564586357037|11024|
|2017|8  |3.7772495755517825|11780|
|2017|7  |3.7793932263215395|11899|
|2017|6  |3.776716364610303 |11201|
|2017|5  |3.7735767057800955|11505|
|2017|4  |3.7772615708274895|11408|
|2017|3  |3.773704832390074 |11485|
|2017|2  |3.7850622406639003|9640 |
|2017|1  |3.8465009023461   |9974 |
|2016|12 |3.7431756141947226|8792 |
|2016|11 |3.8203470975463794|8355 |
|2016|10 |3.804361908874973 |9262 |
|2016|9  |3.8093609745672152|9358 |
|2016|8  |3.716935238674369 |9867 |
|2016|7  |3.794292851652575 |10408|
|2016|6  |3.792252842551551 |10378|
|2016|5  |3.748698167791707 |10370|
|2016|4  |3.7801745269144034|10199|
|2016|3  |3.760687866269574 |10409|
|2016|2  |3.7510244766862333|9029 |
|2016|1  |3.7995110024449876|8998 |
|2015|12 |3.7490269762447994|7451 |
|2015|11 |3.7656909114150583|7823 |
|2015|10 |3.6882107217451847|8618 |
|2015|9  |3.7361559622054776|8361 |
|2015|8  |3.7778601694915253|9440 |
|2015|7  |3.783082169178308 |9091 |
|2015|6  |3.773208793712268 |8779 |
|2015|5  |3.739687216681777 |8824 |
|2015|4  |3.736345405214109 |8477 |
|2015|3  |3.7008845691820467|9157 |
|2015|2  |3.7111705685618728|7475 |
|2015|1  |3.768242992962094 |8099 |
|2014|12 |3.7370758008246114|6306 |
|2014|11 |3.7410472704122233|6283 |
|2014|10 |3.7735793790275336|6828 |
|2014|9  |3.69281045751634  |6426 |
|2014|8  |3.7937560436524382|7239 |
|2014|7  |3.782721088435374 |7350 |
|2014|6  |3.738309215536938 |6565 |
|2014|5  |3.7564234326824253|6811 |
|2014|4  |3.7298904538341158|6390 |
|2014|3  |3.7552275522755227|6504 |
|2014|2  |3.784733662822625 |5463 |
|2014|1  |3.7795438838977193|5788 |
|2013|12 |3.7432378679395386|5028 |
|2013|11 |3.751970227670753 |4568 |
|2013|10 |3.731037310373104 |4878 |
|2013|9  |3.7169363538295577|4635 |
|2013|8  |3.758343148802513 |5094 |
|2013|7  |3.739095151146277 |4929 |
|2013|6  |3.7282901554404146|4825 |
|2013|5  |3.713270685308274 |4363 |
|2013|4  |3.7064879099832417|4177 |
|2013|3  |3.7116104868913857|4539 |
|2013|2  |3.7023809523809526|3612 |
|2013|1  |3.7972648752399234|4168 |
|2012|12 |3.7200259235255997|3086 |
|2012|11 |3.7601626016260163|2952 |
|2012|10 |3.7530339805825244|3296 |
|2012|9  |3.6513790891597178|3118 |
|2012|8  |3.730111077754428 |3331 |
|2012|7  |3.7094285714285715|3500 |
|2012|6  |3.75453514739229  |3528 |
|2012|5  |3.6925535314797058|3129 |
|2012|4  |3.678489326765189 |3045 |
|2012|3  |3.6711409395973154|3129 |
|2012|2  |3.716927453769559 |2812 |
|2012|1  |3.7474659716188823|3453 |
|2011|12 |3.7229470452801228|2606 |
|2011|11 |3.7319461444308444|2451 |
|2011|10 |3.7483095416979713|2662 |
|2011|9  |3.7093065037729067|2783 |
|2011|8  |3.717924821373097 |3219 |
|2011|7  |3.725223732184289 |3017 |
|2011|6  |3.744914971657219 |2999 |
|2011|5  |3.7490454703228044|2881 |
|2011|4  |3.7810890360559233|2718 |
|2011|3  |3.7840103159252094|3102 |
|2011|2  |3.7513747054202673|2546 |
|2011|1  |3.7502694933524974|2783 |
|2010|12 |3.7444616177228234|1941 |
|2010|11 |3.7616892911010558|1989 |
|2010|10 |3.765024630541872 |2030 |
|2010|9  |3.806928171166582 |1963 |
|2010|8  |3.801330376940133 |2255 |
+----+---+------------------+-----+
only showing top 100 rows

In [29]:
datestest

DataFrame[y: int, m: int, count(1): bigint]

In [30]:
phoenix_reviews_df=phoenix_reviews.toPandas()
phoenix_reviews_df.head()

      y   m         s      c
0  2018  11  3.792491   5966
1  2018  10  3.771066  11737
2  2018   9  3.750930  11286
3  2018   8  3.798352  12745
4  2018   7  3.793168  13320

In [31]:
import pandas as pd
import matplotlib.pyplot as plt
import numpy as np

In [32]:
phoenix_unemployment_df = pd.read_csv('phoenix_unemployment.csv')

In [33]:
# phoenixdf.dtypes

NameError: name 'phoenixdf' is not defined

In [36]:
phoenix_unemployment_df['DATE dt']=pd.to_datetime(phoenix_unemployment_df['DATE'])

In [37]:
phoenix_unemployment_df['m'] = phoenix_unemployment_df['DATE dt'].map(lambda x: x.month)
phoenix_unemployment_df['y'] = phoenix_unemployment_df['DATE dt'].map(lambda x: x.year)
phoenix_unemployment_df.head()

     DATE  PHOE004UR    DATE dt  m     y
0  1/1/90        4.4 1990-01-01  1  1990
1  2/1/90        4.4 1990-02-01  2  1990
2  3/1/90        4.4 1990-03-01  3  1990
3  4/1/90        4.5 1990-04-01  4  1990
4  5/1/90        4.5 1990-05-01  5  1990

In [38]:
phoenix_merged=pd.merge(phoenix_unemployment_df, phoenix_reviews_df, how='inner', on=['m', 'y'], left_index=False, right_index=False) 
phoenix_merged=phoenix_merged[phoenix_merged['y'] > 2010]

In [39]:
phoenix_merged.head()

      DATE  PHOE004UR    DATE dt  m     y         s     c
70  1/1/11        9.0 2011-01-01  1  2011  3.750269  2783
71  2/1/11        8.9 2011-02-01  2  2011  3.751375  2546
72  3/1/11        8.8 2011-03-01  3  2011  3.784010  3102
73  4/1/11        8.7 2011-04-01  4  2011  3.781089  2718
74  5/1/11        8.7 2011-05-01  5  2011  3.749045  2881

In [ ]:
plt.scatter(phoenix_merged['PHOE004UR'], phoenix_merged['s'])

In [ ]:
np.corrcoef(phoenix_merged['PHOE004UR'], phoenix_merged['s'])

In [ ]:
import seaborn as sns
sns.regplot(x='PHOE004UR', y='s', data=phoenix_merged);

In [ ]:
import statsmodels.formula.api as smf
mod = smf.ols('PHOE004UR~s', data=phoenix_merged)
res = mod.fit()
res.summary()

#  Sources
- https://fred.stlouisfed.org/series/PHOE004UR